Show / Hide Table of Contents
Class LoadCase
Load case
Inheritance
System.Object
OpenObject
OpenElementId
CalculationCase
LoadCase
Inherited Members
 CalculationCase.Name
 CalculationCase.IsActive
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
public class LoadCase : CalculationCase
Constructors
Improve this Doc   View Source
LoadCase()
Constructor
Declaration
public LoadCase()
Properties
Improve this Doc   View Source
Load
Load
Declaration
public List<LoadBase> Load { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<LoadBase>
Improve this Doc   View Source
LoadCaseType
Type of load case
Declaration
public LoadCaseType LoadCaseType { get; set; }
Property Value
 Type |  Description
 LoadCaseType
 Improve this Doc
 View Source